<?php
//事務局のメールアドレス
define("MASTER_TO_EMAIL", "atsumaru@koubo.co.jp");
//define("MASTER_TO_EMAIL", "system@weblab.co.jp");

//システムから送信されるメールのFROMメールアドレス/名称
define("SYSTEM_FROM_EMAIL", "atsumaru@koubo.co.jp");
//define("SYSTEM_FROM_EMAIL", "system@weblab.co.jp");
define("SYSTEM_FROM_NAME", "公募ガイド あつま～る事務局");

//ver1.5開発分を表示するかどうか true/false
define("DISPV15", true);

//事務局アカウント作成機能の表示 初期作成後はfalseにしてください。
define("MASTER_ADD_PAGE", false);

//画像アップロードの共通サイズ上限
define("UPLOAD_MAX_SIZE", "5MB");

//年選択の共通範囲
define("YEAR_START", 2017);
define("YEAR_END", date("Y",strtotime("+2 year")));

//テキストの共通文字数制限
define("TEXT_MAX_SIZE", 100);

//テキストの共通文字数制限
define("OWMER_URL_MAX_SIZE", 150);

//自由選択項目の値の共通文字数制限
define("FM_FREE_VALUES_MAX_SIZE", 200);

//テキストエリアの共通文字数制限
define("TEXTAREA_MAX_SIZE", 5000);

//パスワードの最小文字数と最大文字数
define("PASSWORD_MIN_SIZE", 8);
define("PASSWORD_MAX_SIZE", 20);

//パスワード再発行時のパスワード桁数
define("PASSWORD_ISSUE_SIZE", 10);

//コンテストURLの最小文字数と最大文字数
define("URL_MIN_SIZE", 4);
define("URL_MAX_SIZE", 150);

//応募作品数の上限選択数
define("WORK_LIMIT", 20);

//作品ファイル添付機能が無制限でない場合のファイル添付サイズ上限
define("WORK_FREE_FILE_SIZE", "3MB");

//高岡コンペを選択している場合のファイル添付サイズ上限 20210709 Yu.Ebina Add
define("WORK_TAKAOKA_FILE_SIZE", "30MB");

//応募一覧テキストボックス表示文字数
define("APPLY_LIST_TEXTBOX_LENGTH", 40);

//URLデフォルト文字列
define("URL_DEFAULT_VALUE", "http://");

//投票cookie_keyの名前
define("COOKIE_KEY_NAME", "_kb_sy_ky");

//投票cookie_keyの長さ
define("COOKIE_KEY_SIZE", 50);

//投票cookie_keyの有効期限の日付
define("COOKIE_KEY_EXPIRES", 365);

//投票 一人当たりの投票数デフォルト
define("VOTE_MAX_DEFAULT", 3);

//投票 一人当たりの投票数デフォルト
define("VOTE_LIST_PAGE_MAX_DEFAULT", 20);

//デフォルトテンプレート/カラー
define("DEFAULT_TEMPLATE", "a");
define("DEFAULT_COLOR", "1");

//選択項目数
define("NUMBER_OF_FREE", 5);

//入力欄(1行)項目数
define("NUMBER_OF_TEXT", 5);

//入力欄(複数行)項目数
define("NUMBER_OF_TEXTAREA", 5);

//ファイル添付の種類
$config['accept_file_type'] = array(
	"jpg",
	"jpeg",
	"png",
	"gif",
	"txt",
	"pdf",
	"doc",
	"docx",
	"xls",
	"xlsx",
	"ppt",
	"pptx",
);
$config['accept_mime_type'] = array(
	"image/jpeg",
	"image/png",
	"image/gif",
	"text/plain",
	"application/pdf",
	"application/msword",
	"application/vnd.openxmlformats-officedocument.wordprocessingml.document",
	"application/msexcel",
	"application/vnd.openxmlformats-officedocument.spreadsheetml.sheet",
	"application/mspowerpoint",
	"application/vnd.openxmlformats-officedocument.presentationml.presentation",
);

$config['accept_file_video'] = array(
	"mp4",
	"wmv",
	"avi",
	"mov",
);
$config['accept_mime_video'] = array(
	"video/mp4",
	"video/x-ms-wmv",
	"video/x-ms-asf",
	"video/x-msvideo",
	"video/quicktime",
);

$config['options'] = array(
	"option_work_search"     => "応募作品検索機能",
	"option_file_limitless"  => "作品ファイル添付機能(容量無制限)",
	"option_file_movie"      => "作品ファイル添付機能(動画)",
	"option_reception_mail"  => "ユーザー宛応募受付メール自動送信機能",
	"option_result_mail"     => "個別メール/結果発表メール送信機能",
	"option_batch_download"  => "データ一括ダウンロード機能",
	"option_work_judge"      => "審査員作品評価機能",

	"option_design_template" => "デザインテンプレート選択機能",
	"option_work_published"  => "応募作品公開機能",
	"option_work_vote"       => "応募作品投票/ランキング機能",
	"option_work_edit"       => "応募内容編集機能",
	"option_sns_button"      => "SNS連携機能",
	"option_analytics_tag"   => "アクセス解析機能",
	"option_original_domain" => "独自ドメイン機能",

	"option_set_division"    => "応募作品 部門設定機能",
    "option_work_kana"       => "作品ふりがな入力欄追加機能",
    "option_work_desc"       => "作品趣旨入力欄追加機能",
	"option_addfree"         => "選択項目追加機能",
	"option_addtext"         => "入力欄追加機能",
);

//一覧表示用
$config['options_icon'] = array(
	"option_work_search"     => "検索",
	"option_file_limitless"  => "容量",
	"option_file_movie"      => "動画",
	"option_reception_mail"  => "受付",
	"option_result_mail"     => "MAIL",
	"option_batch_download"  => "DL",
	"option_work_judge"      => "評価",

	"option_design_template" => "デザ",
	"option_work_published"  => "公開",
	"option_work_vote"       => "投票",
	"option_work_edit"       => "編集",
	"option_sns_button"      => "SNS",
	"option_analytics_tag"   => "解析",
	"option_original_domain" => "独自",

	"option_set_division"    => "部門",
    "option_work_kana"       => "かな",
    "option_work_desc"       => "趣旨",
	"option_addfree"         => "選択",
	"option_addtext"         => "入力",
);

$config['sex'] = array(
	"2" => "男",
	"3" => "女",
    "1" => "指定しない",
);

$config['job_apply'] = array(
	"1" => "指定しない",
	"2" => "公務員",
	"3" => "教職員",
	"4" => "会社員",
	"5" => "主婦",
	"6" => "学生（大学/大学院/専門学校）",
	"7" => "学生（小中高生）",
	"10" => "フリーランス・自営業",
	"8" => "無職",
	"9" => "その他",
);

$config['job'] = array(
	"1" => "プロ向け",
	"2" => "学生向け",
);

$config['status'] = array(
	"1" => "未承認",
	"2" => "申請済",
	"3" => "承認済",
	"4" => "募集中",
	"5" => "選考中",
	"6" => "発表済",
);

$config['cate'] = array(
	"1" => "川柳・俳句・短歌",
	"2" => "文芸",
	"3" => "アート",
	"4" => "写真・動画",
	"5" => "音楽・芸能",
	"6" => "ネーミング・標語",
	"7" => "ノンセクション",
	"8" => "プレゼント",
);

$config['subcate'][1] = array(
	"101" => "短歌",
	"102" => "俳句",
	"103" => "川柳",
);

$config['subcate'][2] = array(
	"201" => "詩",
	"202" => "メッセージ",
	"203" => "手紙",
	"204" => "作文・エピソード",
	"205" => "感想文",
	"206" => "体験記・旅行記",
	"207" => "エッセイ",
	"208" => "童話・児童文学",
	"209" => "ライトノベル",
	"210" => "小説",
	"211" => "ノンフィクション",
	"212" => "シナリオ・脚本・台本・戯曲",
	"213" => "論文・評論",
	"214" => "記事・ブログ・投稿",
	"215" => "ストーリー",
	"216" => "漫画原作",
	"217" => "その他",
);

$config['subcate'][3] = array(
	"301" => "シンボルマーク",
	"302" => "ロゴマーク",
	"303" => "キャラクターデザイン",
	"304" => "ナンバープレート",
	"305" => "絵本・紙芝居",
	"306" => "マンガ・コミック",
	"307" => "イラスト",
	"308" => "絵手紙・絵日記・絵葉書",
	"309" => "年賀状",
	"310" => "チラシ・表紙・ポスターデザイン",
	"311" => "ジュエリー・アパレル・ファッションデザイン",
	"312" => "その他デザイン・デザインコンペ",
	"313" => "書道",
	"314" => "版画",
	"315" => "絵画（日本画・洋画）・美術展",
	"316" => "ハンドメイド",
	"317" => "ＤＩＹ",
	"318" => "陶芸・工芸・クラフト",
	"319" => "彫刻・オブジェ",
	"320" => "ＣＧ・デジタル",
	"321" => "建築・設計・景観デザイン",
	"322" => "ＷＥＢ・ホームページデザイン",
	"323" => "お絵描き・ぬり絵・図画工作",
	"324" => "ラベル・パッケージデザイン",
	"325" => "プロダクトデザイン",
	"326" => "その他",
);

$config['subcate'][4] = array(
	"401" => "写真",
	"402" => "観光写真",
	"403" => "動画・ムービー・ビデオ",
	"404" => "映像",
);

$config['subcate'][5] = array(
	"501" => "作詞",
	"502" => "作曲・編曲",
	"503" => "クラシック系コンクール",
	"504" => "バンドオーディション",
	"505" => "ボーカル・カラオケ・歌唱",
	"506" => "ミスコン",
	"507" => "アイドル・タレント・モデル・声優",
	"508" => "ダンス",
	"509" => "出演者・アシスタント",
	"5010" => "その他",
);

$config['subcate'][6] = array(
	"601" => "ネーミング",
	"602" => "標語",
	"603" => "コピー",
	"604" => "短文・大喜利",
	"605" => "クイズ",
	"606" => "漢字",
	"607" => "その他",
);

$config['subcate'][7] = array(
	"701" => "料理・レシピ",
	"702" => "スピーチ・弁論",
	"703" => "アイデア",
	"704" => "ＣＭコピー",
	"705" => "モニター・レポーター",
	"706" => "参加イベント",
	"707" => "企画・プラン",
	"708" => "助成",
	"710" => "ゲーム・アプリ・プログラム",
	"711" => "アンケート",
	"712" => "パブリックコメント・意見・投票",
	"713" => "候補者・推薦者",
	"714" => "体験・見学会",
	"715" => "アンバサダー・大使・特派員",
	"716" => "フラワーデザイン・ガーデニング",
	"717" => "その他",
);

$config['subcate'][8] = array(
	"801" => "豪華賞品",
	"802" => "食品",
	"803" => "生活グッズ",
	"804" => "ファッション・化粧品",
	"805" => "趣味・娯楽",
	"806" => "金券",
	"807" => "その他（懸賞）",
	"808" => "お得情報",
);

$config['limit'] = array(
	//"1" => "1件表示",
	"10" => "10件表示",
	"20" => "20件表示",
	"30" => "30件表示",
	"40" => "40件表示",
	"50" => "50件表示",
	"60" => "60件表示",
	"70" => "70件表示",
	"80" => "80件表示",
	"90" => "90件表示",
	"100" => "100件表示",
);

$config['pref'] = array(
	"1" => "北海道",
	"2" => "青森県",
	"3" => "岩手県",
	"4" => "宮城県",
	"5" => "秋田県",
	"6" => "山形県",
	"7" => "福島県",
	"8" => "茨城県",
	"9" => "栃木県",
	"10" => "群馬県",
	"11" => "埼玉県",
	"12" => "千葉県",
	"13" => "東京都",
	"14" => "神奈川県",
	"15" => "新潟県",
	"16" => "富山県",
	"17" => "石川県",
	"18" => "福井県",
	"19" => "山梨県",
	"20" => "長野県",
	"21" => "岐阜県",
	"22" => "静岡県",
	"23" => "愛知県",
	"24" => "三重県",
	"25" => "滋賀県",
	"26" => "京都府",
	"27" => "大阪府",
	"28" => "兵庫県",
	"29" => "奈良県",
	"30" => "和歌山県",
	"31" => "鳥取県",
	"32" => "島根県",
	"33" => "岡山県",
	"34" => "広島県",
	"35" => "山口県",
	"36" => "徳島県",
	"37" => "香川県",
	"38" => "愛媛県",
	"39" => "高知県",
	"40" => "福岡県",
	"41" => "佐賀県",
	"42" => "長崎県",
	"43" => "熊本県",
	"44" => "大分県",
	"45" => "宮崎県",
	"46" => "鹿児島県",
	"47" => "沖縄県",
	"48" => "その他(海外)",
);

$config['ado_disp_type'] = array(
	"1" => "大",
	"2" => "中",
	"3" => "小",
);

$config['evaluation'] = array(
	"5" => "★★★★★",
	"4" => "★★★★",
	"3" => "★★★",
	"2" => "★★",
	"1" => "★",
);

$config['conv_koubo'] = array(
	"101" => "1",
	"102" => "2",
	"103" => "3",
	"201" => "4",
	"202" => "5",
	"203" => "6",
	"204" => "7",
	"205" => "8",
	"206" => "9",
	"207" => "10",
	"208" => "11",
	"209" => "12",
	"210" => "13",
	"211" => "14",
	"212" => "15",
	"213" => "16",
	"214" => "17",
	"215" => "18",
	"216" => "19",
	"217" => "20",
	"301" => "21",
	"302" => "22",
	"303" => "23",
	"304" => "24",
	"305" => "25",
	"306" => "26",
	"307" => "27",
	"308" => "28",
	"309" => "29",
	"310" => "30",
	"311" => "31",
	"312" => "32",
	"313" => "33",
	"314" => "34",
	"315" => "35",
	"316" => "36",
	"317" => "37",
	"318" => "38",
	"319" => "39",
	"320" => "40",
	"321" => "41",
	"322" => "42",
	"323" => "43",
	"324" => "44",
	"325" => "45",
	"326" => "46",
	"401" => "47",
	"402" => "48",
	"403" => "49",
	"404" => "50",
	"501" => "51",
	"502" => "52",
	"503" => "53",
	"504" => "54",
	"505" => "55",
	"506" => "56",
	"507" => "57",
	"508" => "58",
	"509" => "59",
	"5010" => "60",
	"601" => "61",
	"602" => "62",
	"603" => "63",
	"604" => "64",
	"605" => "65",
	"606" => "66",
	"607" => "67",
	"701" => "68",
	"702" => "69",
	"703" => "70",
	"704" => "71",
	"705" => "72",
	"706" => "73",
	"707" => "74",
	"708" => "75",
	"710" => "76",
	"711" => "77",
	"712" => "78",
	"713" => "79",
	"714" => "80",
	"715" => "81",
	"716" => "82",
	"717" => "83",
	"801" => "84",
	"802" => "85",
	"803" => "86",
	"804" => "87",
	"805" => "88",
	"806" => "89",
	"807" => "90",
	"808" => "91",
);

$config['material'] = array(
	"1" => "金属",
	"2" => "漆",
	"3" => "木工",
	"4" => "陶磁器",
	"5" => "ガラス",
	"6" => "ジュエリー",
	"7" => "テキスタイル",
	"8" => "家具",
	"9" => "照明",
	"10" => "その他",
);

//BASE_URI
define('API_BASE_URI', 'https://api.thebase.in');